app/Controllers/KaryawanController.php

SELECT *
FROM `karyawan`
SELECT *
FROM `assets`
SELECT *
FROM `log_asset`
SELECT *
FROM `peminjaman`
SELECT *
FROM `pengaduan`
SELECT *
FROM `tracking`
SELECT *
FROM `investasi`
SELECT *
FROM `images`
SELECT *
FROM `user`
SELECT *
FROM `log_peminjaman`
SELECT *
FROM `log_tracking`
---
    public function index()
    {
        $user = new ModelsKaryawan();
        $assetModel = new AssetModel();
        $logAssetModel = new LogAssetModel();
        $peminjamanModel = new PeminjamanModel();
        $PengaduanModel = new PengaduanModel();
        $TrackingModel = new TrackingModel();
        $InvestasiModel = new InvestasiModel();
        $ImageModel = new ImageModel();
        $userModel = new UserModel();
        $logPeminjamanModel = new LogPeminjamanModel();
        $logTrackingModel = new LogTrackingModel();

        $data['karyawan'] = $user->findAll();
        $data['assets'] = $assetModel->findAll();
        $data['log_asset'] = $logAssetModel->findAll();
        $data['peminjaman'] = $peminjamanModel->findAll();
        $data['pengaduan'] = $PengaduanModel->findAll();
        $data['tracking'] = $TrackingModel->findAll();
        $data['investasi'] = $InvestasiModel->findAll();
        $data['images'] = $ImageModel->findAll();
        $data['users'] = $userModel->findAll();
        $data['log_peminjaman'] = $logPeminjamanModel->findAll();
        $data['log_tracking'] = $logTrackingModel->findAll();