app/Controllers/LoginUser.php

SELECT *
FROM `user`
WHERE `username` = 'tipal'
 LIMIT 1
---
    public function index()
    {
        $UserModel = new \App\Models\Usermodel();
        $login = $this->request->getPost('login');
        if ($login) {
            $username = $this->request->getPost('karyawan_username');
            $password = $this->request->getPost('karyawan_password');

            if ($username == '' || $password == '') {
                $err = "Silahkan masukan username dan password";
            }

            if (empty($err)) {
                $datauser = $UserModel->where("username", $username)->first();