app/Controllers/Login.php

    public function index()
    {
        $Modelskaryawan = new \App\Models\ModelsKaryawan();
        $login = $this->request->getPost('login');
        if ($login) {
            $karyawan_username = $this->request->getPost('karyawan_username');
            $karyawan_password = $this->request->getPost('karyawan_password');

            if ($karyawan_username == '' || $karyawan_password == '') {
                $err = "Silahkan masukan username dan password";
            }

            if (empty($err)) {
                $dataKaryawan = $Modelskaryawan->where("karyawan_username", $karyawan_username)->first();
---
SELECT *
FROM `karyawan`
WHERE `karyawan_username` = 'admin'
 LIMIT 1