app/Controllers/PengaduanUser.php

SELECT *
FROM `pengaduan`
---
    public function index()
    {
    $pengaduanModel = new PengaduanModel();
    $data['pengaduan'] = $pengaduanModel->findAll();