app/Views/karyawan.php

SELECT *
FROM `karyawan`
WHERE `karyawan_username` = 'tipal'
 LIMIT 1
---

              // Panggil model Karyawan
              $karyawanModel = new \App\Models\ModelsKaryawan();
              $karyawan = $karyawanModel->where('karyawan_username', $username)->first();

SELECT *
FROM `investasi`
---
        // Ambil data dari model InvestasiModel
        <?php
        $investasiModel = new \App\Models\InvestasiModel();
        $investasiData = $investasiModel->findAll();